rottenpotatoes/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]
---
  def director
    @movie = Movie.find params[:id]
    @director = @movie.director
    if @director == ""
      flash[:notice] = "\'#{@movie.title}\' has no director info."
      redirect_to movies_path
    end
    @movies = Movie.where(director: @director)